{"modelTopology": {"model_config": {"class_name": "Model", "config": {"name": "xception", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, null, null, 3], "dtype": "float32"}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "trainable": true, "name": "block1_conv1", "activity_regularizer": null, "filters": 32, "strides": [2, 2], "activation": "linear", "data_format": "channels_last"}}, {"name": "block1_conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block1_conv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block1_conv1_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"name": "block1_conv1_act", "activation": "relu", "trainable": true}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "padding": "valid", "bias_constraint": null, "trainable": true, "name": "block1_conv2", "activity_regularizer": null, "filters": 64, "strides": [1, 1], "activation": "linear", "data_format": "channels_last"}}, {"name": "block1_conv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block1_conv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block1_conv2_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"name": "block1_conv2_act", "activation": "relu", "trainable": true}}, {"name": "block2_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block2_sepconv1", "activity_regularizer": null, "filters": 128, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block2_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block2_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block2_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block2_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block2_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block2_sepconv2", "activity_regularizer": null, "filters": 128, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block2_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block2_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "trainable": true, "name": "conv2d_1", "activity_regularizer": null, "filters": 128, "strides": [2, 2], "activation": "linear", "data_format": "channels_last"}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"padding": "same", "strides": [2, 2], "pool_size": [3, 3], "trainable": true, "name": "block2_pool", "data_format": "channels_last"}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "block3_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "block3_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block3_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block3_sepconv1", "activity_regularizer": null, "filters": 256, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block3_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block3_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block3_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block3_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block3_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block3_sepconv2", "activity_regularizer": null, "filters": 256, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block3_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block3_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "filters": 256, "strides": [2, 2], "activation": "linear", "data_format": "channels_last"}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"padding": "same", "strides": [2, 2], "pool_size": [3, 3], "trainable": true, "name": "block3_pool", "data_format": "channels_last"}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "block4_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "block4_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block4_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block4_sepconv1", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block4_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block4_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block4_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block4_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block4_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block4_sepconv2", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block4_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block4_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "padding": "same", "bias_constraint": null, "trainable": true, "name": "conv2d_3", "activity_regularizer": null, "filters": 728, "strides": [2, 2], "activation": "linear", "data_format": "channels_last"}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"padding": "same", "strides": [2, 2], "pool_size": [3, 3], "trainable": true, "name": "block4_pool", "data_format": "channels_last"}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "block5_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "block5_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block5_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block5_sepconv1", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block5_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block5_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block5_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block5_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block5_sepconv2", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block5_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block5_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block5_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block5_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block5_sepconv3", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block5_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block5_sepconv3_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "block6_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "block6_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block6_sepconv1", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block6_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block6_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block6_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block6_sepconv2", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block6_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block6_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block6_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block6_sepconv3", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block6_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block6_sepconv3_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "block7_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "block7_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block7_sepconv1", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block7_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block7_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block7_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block7_sepconv2", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block7_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block7_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block7_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block7_sepconv3", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block7_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block7_sepconv3_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "block8_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "block8_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block8_sepconv1", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block8_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block8_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block8_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block8_sepconv2", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block8_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block8_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block8_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block8_sepconv3", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block8_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block8_sepconv3_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "block9_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "block9_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block9_sepconv1", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block9_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block9_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block9_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block9_sepconv2", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block9_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block9_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block9_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block9_sepconv3", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block9_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block9_sepconv3_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "block10_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "block10_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block10_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block10_sepconv1", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block10_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block10_sepconv1_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block10_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block10_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block10_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block10_sepconv2", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "depthwise_constraint": null}}, {"name": "block10_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]], "config": {"momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "axis": -1, "center": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "name": "block10_sepconv2_bn", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"name": "block10_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block10_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block10_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "pointwise_constraint": null, "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "padding": "same", "bias_constraint": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "trainable": true, "name": "block10_sepconv3", "activity_regularizer": null, "filters": 728, "pointwise_regularizer": null, "strides": [1, 1], "activation": "linear", 