{"modelTopology": {"model_config": {"config": {"name": "resnet50", "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv1_pad", "config": {"name": "conv1_pad", "trainable": true, "data_format": "channels_last", "padding": [[3, 3], [3, 3]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1", "config": {"bias_regularizer": null, "filters": 64, "padding": "valid", "bias_constraint": null, "strides": [2, 2], "name": "conv1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [7, 7], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"name": "bn_conv1", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn_conv1", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "pool1_pad", "config": {"name": "pool1_pad", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [3, 3]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["pool1_pad", 0, 0, {}]]]}, {"name": "res2a_branch2a", "config": {"bias_regularizer": null, "filters": 64, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res2a_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2a_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2b", "config": {"bias_regularizer": null, "filters": 64, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res2a_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2a_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch2c", "config": {"bias_regularizer": null, "filters": 256, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res2a_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "res2a_branch1", "config": {"bias_regularizer": null, "filters": 256, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res2a_branch1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2a_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "bn2a_branch1", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2a_branch1", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "res2b_branch2a", "config": {"bias_regularizer": null, "filters": 64, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res2b_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2b_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "res2b_branch2b", "config": {"bias_regularizer": null, "filters": 64, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res2b_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2b_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "res2b_branch2c", "config": {"bias_regularizer": null, "filters": 256, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res2b_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2b_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_2", "config": {"name": "add_2", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"name": "activation_7", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "res2c_branch2a", "config": {"bias_regularizer": null, "filters": 64, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res2c_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2c_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_8", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "res2c_branch2b", "config": {"bias_regularizer": null, "filters": 64, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res2c_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2c_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "res2c_branch2c", "config": {"bias_regularizer": null, "filters": 256, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res2c_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn2c_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_3", "config": {"name": "add_3", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "res3a_branch2a", "config": {"bias_regularizer": null, "filters": 128, "padding": "valid", "bias_constraint": null, "strides": [2, 2], "name": "res3a_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3a_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_11", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "config": {"bias_regularizer": null, "filters": 128, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res3a_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3a_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_12", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch2c", "config": {"bias_regularizer": null, "filters": 512, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res3a_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "res3a_branch1", "config": {"bias_regularizer": null, "filters": 512, "padding": "valid", "bias_constraint": null, "strides": [2, 2], "name": "res3a_branch1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3a_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "bn3a_branch1", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3a_branch1", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_4", "config": {"name": "add_4", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_13", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "res3b_branch2a", "config": {"bias_regularizer": null, "filters": 128, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res3b_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3b_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"name": "activation_14", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "config": {"bias_regularizer": null, "filters": 128, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res3b_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3b_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_15", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "res3b_branch2c", "config": {"bias_regularizer": null, "filters": 512, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res3b_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "bn3b_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3b_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"name": "add_5", "config": {"name": "add_5", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"name": "activation_16", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "res3c_branch2a", "config": {"bias_regularizer": null, "filters": 128, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res3c_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "bn3c_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3c_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"name": "activation_17", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"name": "res3c_branch2b", "config": {"bias_regularizer": null, "filters": 128, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res3c_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "bn3c_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3c_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"name": "activation_18", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"name": "res3c_branch2c", "config": {"bias_regularizer": null, "filters": 512, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res3c_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "bn3c_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3c_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"name": "add_6", "config": {"name": "add_6", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "activation_19", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "res3d_branch2a", "config": {"bias_regularizer": null, "filters": 128, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res3d_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3d_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"name": "activation_20", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "config": {"bias_regularizer": null, "filters": 128, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res3d_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3d_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_21", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "res3d_branch2c", "config": {"bias_regularizer": null, "filters": 512, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res3d_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "bn3d_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn3d_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"name": "add_7", "config": {"name": "add_7", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "activation_22", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "res4a_branch2a", "config": {"bias_regularizer": null, "filters": 256, "padding": "valid", "bias_constraint": null, "strides": [2, 2], "name": "res4a_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4a_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "activation_23", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2b", "config": {"bias_regularizer": null, "filters": 256, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res4a_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4a_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "activation_24", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch2c", "config": {"bias_regularizer": null, "filters": 1024, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res4a_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "res4a_branch1", "config": {"bias_regularizer": null, "filters": 1024, "padding": "valid", "bias_constraint": null, "strides": [2, 2], "name": "res4a_branch1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn4a_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4a_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"name": "bn4a_branch1", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4a_branch1", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "add_8", "config": {"name": "add_8", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "activation_25", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "res4b_branch2a", "config": {"bias_regularizer": null, "filters": 256, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res4b_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "bn4b_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4b_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"name": "activation_26", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"name": "res4b_branch2b", "config": {"bias_regularizer": null, "filters": 256, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res4b_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"name": "bn4b_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4b_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"name": "activation_27", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"name": "res4b_branch2c", "config": {"bias_regularizer": null, "filters": 1024, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res4b_branch2c", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"name": "bn4b_branch2c", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4b_branch2c", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"name": "add_9", "config": {"name": "add_9", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]]}, {"name": "activation_28", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "res4c_branch2a", "config": {"bias_regularizer": null, "filters": 256, "padding": "valid", "bias_constraint": null, "strides": [1, 1], "name": "res4c_branch2a", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"name": "bn4c_branch2a", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4c_branch2a", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"name": "activation_29", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"name": "res4c_branch2b", "config": {"bias_regularizer": null, "filters": 256, "padding": "same", "bias_constraint": null, "strides": [1, 1], "name": "res4c_branch2b", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"name": "bn4c_branch2b", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "bn4c_branch2b", "momentum": 0.99, "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"name": "activation_30", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, {"name": "res4c_branch2c", "config": {"bias_regularizer": null, "filters": 1024, "padding": "valid",